tap "homebrew/bundle"
tap "nikitabobko/tap"
tap "nomandhoni-cs/blinkeye"
tap "oven-sh/bun"
brew "ack"
brew "aws-vault"
brew "cloc"
brew "cmake"
brew "coder"
brew "convmv"
brew "deno"
brew "dua-cli"
brew "entr"
brew "sdl2"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "git"
brew "git-filter-repo"
brew "gnupg"
brew "go"
brew "librsvg"
brew "graphviz"
brew "grep"
brew "htop"
brew "jq"
brew "kubernetes-cli"
brew "llama.cpp"
brew "neovim"
brew "nmap"
brew "nvm"
brew "pandoc"
brew "plantuml"
brew "pnpm"
brew "pyenv"
brew "qemu"
brew "qt"
brew "ripgrep"
brew "rustup"
brew "terraform"
brew "texlive"
brew "tmux"
brew "tree"
brew "typst"
brew "wget"
brew "wrk"
brew "xcodegen"
brew "zig"
brew "zsh"
brew "oven-sh/bun/bun"
cask "aerospace"
cask "alfred"
cask "amethyst"
cask "anki"
cask "appcleaner"
cask "blockblock"
cask "chromium"
cask "cursor"
cask "docker"
cask "figma"
cask "fleet"
cask "font-new-computer-modern"
cask "font-symbols-only-nerd-font"
cask "ghostty"
cask "intellij-idea"
cask "kitty"
cask "knockknock"
cask "libreoffice"
cask "mathpix-snipping-tool"
cask "microsoft-teams"
cask "obsidian"
cask "ollama"
cask "skim"
cask "transmission"
cask "vlc"
cask "vscodium"
cask "zed"
