tap "danvergara/tools"
tap "homebrew/bundle"
tap "nikitabobko/tap"
tap "nomandhoni-cs/blinkeye"
tap "oven-sh/bun"
brew "ack"
brew "aws-vault"
brew "readline"
brew "awscli"
brew "batt"
brew "bear"
brew "cloc"
brew "cmake"
brew "coder"
brew "convmv"
brew "deno"
brew "dua-cli"
brew "emscripten"
brew "entr"
brew "sdl2"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "git"
brew "git-filter-repo"
brew "gnupg"
brew "go"
brew "librsvg"
brew "graphviz"
brew "grep"
brew "htop"
brew "jq"
brew "kubernetes-cli"
brew "llama.cpp"
brew "llvm"
brew "lld"
brew "macmon"
brew "minikube"
brew "neovim"
brew "nmap"
brew "nvm"
brew "pandoc"
brew "plantuml"
brew "pnpm"
brew "pyenv"
brew "qemu"
brew "qt"
brew "ripgrep"
brew "rustup"
brew "stripe-cli"
brew "terraform"
brew "texlive"
brew "tmux"
brew "tree"
brew "typst"
brew "wabt"
brew "wget"
brew "wrk"
brew "xcodegen"
brew "zig"
brew "zsh"
brew "danvergara/tools/dblab"
brew "oven-sh/bun/bun"
cask "aerospace"
cask "alfred"
cask "amethyst"
cask "anki"
cask "appcleaner"
cask "blockblock"
cask "chromium"
cask "claude"
cask "cursor"
cask "docker"
cask "figma"
cask "font-new-computer-modern"
cask "font-symbols-only-nerd-font"
cask "ghostty"
cask "intellij-idea"
cask "knockknock"
cask "libreoffice"
cask "mathpix-snipping-tool"
cask "microsoft-teams"
cask "obsidian"
cask "ollama"
cask "protonvpn"
cask "skim"
cask "transmission"
cask "vlc"
cask "vscodium"
cask "zed"
vscode "aaron-bond.better-comments"
vscode "bierner.markdown-preview-github-styles"
vscode "eamodio.gitlens"
vscode "jeanp413.open-remote-ssh"
vscode "jock.svg"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ritwickdey.liveserver"
vscode "supermaven.supermaven"
vscode "svelte.svelte-vscode"
vscode "tomoki1207.pdf"
vscode "twxs.cmake"
vscode "vscodevim.vim"
vscode "yoavbls.pretty-ts-errors"
vscode "yzhang.markdown-all-in-one"
