tap "achannarasappa/tap"
tap "bufbuild/buf"
tap "danvergara/tools"
tap "homebrew/bundle"
tap "nikitabobko/tap"
tap "nomandhoni-cs/blinkeye"
tap "oven-sh/bun"
tap "sst/tap"
# Converts abc music notation files to MIDI files
brew "abcmidi"
# Search tool like grep, but optimized for programmers
brew "ack"
# Run your GitHub Actions locally
brew "act"
# Library for command-line editing
brew "readline"
# General-purpose data compression with high compression ratio
brew "xz"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Automate deployment, configuration, and upgrading
brew "ansible"
# Arduino command-line interface
brew "arduino-cli"
# Text processor and publishing toolchain for AsciiDoc
brew "asciidoctor"
# Automatically restart SSH sessions and tunnels
brew "autossh"
# Securely store and access AWS credentials in development environments
brew "aws-vault"
# Official Amazon AWS command-line interface
brew "awscli"
# Command-line tool for interacting with the balenaCloud and balena API
brew "balena-cli"
# Control and limit battery charging on Apple Silicon MacBooks
brew "batt", restart_service: :changed
# Generate compilation database for clang tooling
brew "bear"
# CD/DVD/Blu-ray premastering and recording software
brew "cdrtools"
# Statistics utility to count lines of code
brew "cloc"
# Cross-platform make
brew "cmake"
# Tool for provisioning self-hosted development environments with Terraform
brew "coder"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# OpenAI's coding agent that runs in your terminal
brew "codex"
# Filename encoding conversion tool
brew "convmv"
# Secure runtime for JavaScript and TypeScript
brew "deno"
# View disk space usage and delete unwanted data, fast
brew "dua-cli"
# Lean Theorem Prover installer and version manager
brew "elan-init"
# LLVM bytecode to JavaScript compiler
brew "emscripten"
# Run arbitrary commands when files change
brew "entr"
# ESP8266 and ESP32 serial bootloader utility
brew "esptool"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# Low-level access to audio, keyboard, mouse, joystick, and graphics
brew "sdl2"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# Interact with Google Gemini AI models from the command-line
brew "gemini-cli"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Quickly rewrite git repository history
brew "git-filter-repo"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Library to render SVG files using Cairo
brew "librsvg"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# GNU grep, egrep and fgrep
brew "grep"
# Improved top (interactive process viewer)
brew "htop"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Simple terminal UI for git commands
brew "lazygit"
# LLM inference in C/C++
brew "llama.cpp"
# LLVM Project Linker
brew "lld"
# Curses-based tool for viewing and analyzing log files
brew "lnav"
# Sudoless performance monitoring for Apple Silicon processors
brew "macmon"
# Run a Kubernetes cluster locally
brew "minikube"
# Remote terminal application
brew "mosh"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Port scanning utility for large networks
brew "nmap"
# Manage multiple Node.js versions
brew "nvm"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Minimal dumb-terminal emulation program
brew "picocom"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Draw UML diagrams
brew "plantuml"
# Fast, disk space efficient package manager
brew "pnpm"
# Python version management
brew "pyenv"
# Generic machine emulator and virtualizer
brew "qemu"
# QR Code generation
brew "qrencode"
# Cross-platform application and UI framework
brew "qt"
# Software environment for statistical computing
brew "r"
# Rust toolchain installer
brew "rustup"
# Command-line tool for Stripe
brew "stripe-cli"
# System performance benchmark tool
brew "sysbench"
# User interface to the TELNET protocol
brew "telnet"
# Tool to build, change, and version infrastructure
brew "terraform"
# Free software distribution for the TeX typesetting system
brew "texlive"
# Software synthesizer
brew "timidity"
# Terminal multiplexer
brew "tmux"
# Markup-based typesetting system
brew "typst"
# Unidata unit conversion library
brew "udunits"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Web Assembly Binary Toolkit
brew "wabt"
# Sends magic packets to wake up network-devices
brew "wakeonlan"
# Internet file retriever
brew "wget"
# Library to create, extract, and modify Windows Imaging files
brew "wimlib"
# HTTP benchmarking tool
brew "wrk"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Programming language designed for robustness, optimality, and clarity
brew "zig"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# The best way of working with Protocol Buffers.
brew "bufbuild/buf/buf"
# Interactive client for PostgreSQL and MySQL
brew "danvergara/tools/dblab"
# Incredibly fast JavaScript runtime, bundler, transpiler and package manager - all in one.
brew "oven-sh/bun/bun"
# The AI coding agent built for the terminal.
brew "sst/tap/opencode"
# AeroSpace is an i3-like tiling window manager for macOS
cask "aerospace"
# Application launcher and productivity software
cask "alfred"
# Automatic tiling window manager similar to xmonad
cask "amethyst"
# Memory training application
cask "anki"
# Application uninstaller
cask "appcleaner"
# Monitors common persistence locations
cask "blockblock"
# Free and open-source web browser
cask "chromium"
# Anthropic's official Claude AI desktop app
cask "claude"
# Terminal-based AI coding assistant
cask "claude-code"
# Write, edit, and chat about your code with AI
cask "cursor"
# Command-line agent for Cursor
cask "cursor-cli"
# Browser for SQLite databases
cask "db-browser-for-sqlite"
# App to build and share containerised applications and microservices
cask "docker-desktop"
# Collaborative team software
cask "figma"
cask "font-new-computer-modern"
cask "font-symbols-only-nerd-font"
# 3D parametric modeller
cask "freecad"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Java IDE by JetBrains
cask "intellij-idea"
# Use Vim in input fields and non input fields
cask "kindavim"
# Tool to show what is persistently installed on the computer
cask "knockknock"
# Free cross-platform office suite, fresh version
cask "libreoffice"
# Scanner app for math and science
cask "mathpix-snipping-tool"
# Spreadsheet software
cask "microsoft-excel"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Intercept, modify, replay, save HTTP/S traffic
cask "mitmproxy"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Control your smart light system
cask "philips-hue-sync"
# VPN client focusing on security
cask "protonvpn"
# Scientific and technical publishing system built on Pandoc
cask "quarto"
# Imaging utility to install operating systems to a microSD card
cask "raspberry-pi-imager"
# Tool that provides consistent, highly configurable symbols for apps
cask "sf-symbols"
# PDF reader and note-taking application
cask "skim"
# Team communication and collaboration software
cask "slack"
# Open-source BitTorrent client
cask "transmission"
# 3D printer and slicing GUI
cask "ultimaker-cura"
# Multimedia player
cask "vlc"
# Binary releases of VS Code without MS branding/telemetry/licensing
cask "vscodium"
# Multiplayer code editor
cask "zed"
vscode "aaron-bond.better-comments"
vscode "bierner.markdown-preview-github-styles"
vscode "eamodio.gitlens"
vscode "iterative.dvc"
vscode "jeanp413.open-remote-ssh"
vscode "jock.svg"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ritwickdey.liveserver"
vscode "supermaven.supermaven"
vscode "svelte.svelte-vscode"
vscode "tomoki1207.pdf"
vscode "twxs.cmake"
vscode "vscodevim.vim"
vscode "yoavbls.pretty-ts-errors"
vscode "yzhang.markdown-all-in-one"
go "github.com/google/addlicense"
go "github.com/air-verse/air"
go "fyne.io/fyne/v2/cmd/fyne"
go "github.com/melkeydev/go-blueprint"
go "github.com/golang_starter"
go "golang.org/x/tools/gopls"
go "github.com/nishanths/license/v5"
go "github.com/golang-migrate/migrate/v4/cmd/migrate"
go "connectrpc.com/connect/cmd/protoc-gen-connect-go"
go "google.golang.org/protobuf/cmd/protoc-gen-go"
go "github.com/sqlc-dev/sqlc/cmd/sqlc"
go "honnef.co/go/tools/cmd/staticcheck"
go "github.com/a-h/templ/cmd/templ"
cargo "caesiumclt"
cargo "create-tauri-app"
cargo "ttyper"
